doc/src/hibari/images-src/brick-fsm.dot
//
// Copyright (c) 2005-2010 Gemini Mobile Technologies, Inc.  All rights reserved.
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//

digraph data_flow {
    {rank=same; start unknown};
    start [label="Start"];
    unknown [label="Unknown"];
    pre_init [label="Pre_init"];
    repairing [label="Repairing"];
    ok [label="OK"];
    disk_error [label="Disk_error"];

    start -> unknown;
    unknown -> pre_init;
    pre_init -> repairing;
    pre_init -> ok;
    pre_init -> unknown;
    repairing -> ok;
    repairing -> unknown;
    ok -> disk_error;
    ok -> unknown;
    disk_error -> pre_init;
    disk_error -> unknown;
};
